# Columns Selection Pada Data Frame Berdasarkan Tipe Data

In [7]:
import pandas as pd #mengimport pandas sebagai pd
import numpy as np #mengimport pandas sebagai np

print(pd.__version__) #menampilkan pandas versi
print(np.__version__) #menampilkan numpy versi

1.1.3
1.19.2

In [ ]:
r = 5 #jumlah baris
c = 2 #jumlah colom
cols = ['bil_pecahan', 'bil_bulat'] #kedua colom dinamakan bilpec dan bilbul

df = pd.DataFrame(np.random.randint(1, 20, size=(r, c)),columns=cols)
#pd.Dataframe = membuat sebuah frame dengan diisi oleh bilangan int secara random
#dengan jangkauan angka dari 1 sampai 20  lalu size dimensi colom dan barisnya diukur sesuai R dan C
#dengan nama columns dari var cols

df['bil_pecahan'] = df['bil_pecahan'].astype('float')
#mengkonversi bilangan pecahan kedalam float dengan menggunakan astype

df.index = pd.util.testing.makeDataIndex(r, freq='H')
#membuat index bertipe data datetime dan freq H mengindikasikan jam
df = df.reset_index() #mengenerate index baru berupa index int

df['teks'] = list('ABCDE') #menambah colom teks berisi "ABCDE"

df

In [14]:
df.dtypes #untuk mengetahui tipe data pada frame

bilpec    float64
bilbul      int32
dtype: object

## Selection pada tipe data numerik

In [15]:
df.select_dtypes(include='number') #menampilkan colom dan tipe data numerik

   bilpec  bilbul
0     5.0      10
1     5.0       7
2    15.0       9
3    11.0       5
4    16.0       9

In [16]:
df.select_dtypes(include='float') #menampilkan colom dan tipe data float

   bilpec
0     5.0
1     5.0
2    15.0
3    11.0
4    16.0

In [17]:
df.select_dtypes(include='int') #menampilkan colom dan tipe data int

   bilbul
0      10
1       7
2       9
3       5
4       9

## Selection pada tipe data String atau Object

In [18]:
df.select_dtypes(include='object') #menampilkan colom dan tipe data string

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

## Selection pada tipe data Datetime

In [14]:
df.select_dtypes(include='datetime') #menampilkan colom dan tipe data datetime

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

## Selection pada kombinasi tipe data

In [20]:
df.select_dtypes(include=['number', 'object']) 
#menampilakn kombinasi data dengan menggunakan parameter include dengan list seperti contoh tersebut.

   bilpec  bilbul
0     5.0      10
1     5.0       7
2    15.0       9
3    11.0       5
4    16.0       9